/*
กำหนดจำนวนเต็ม N ดำเนินการตามเงื่อนไขต่อไปนี้:
- ถ้า N เป็นเลขคี่ให้พิมพ์ Weird
- ถ้า N เป็นเลขคู่และอยู่ในช่วง 2 ถึง 5 ให้พิมพ์ Not Weird
- ถ้า N เป็นเลขคู่และอยู่ในช่วง 6 ถึง 20 ให้พิมพ์ Weird
- ถ้า N เป็นเลขคู่และมากกว่า 20 ให้พิมพ์ Not Weird
 */

// ตามที่โจทย์กำหนด เราสามารถเขียนโปรแกรมเพื่อตรวจสอบเงื่อนไขดังกล่าวใน Java 8 ได้ดังนี้:

import java.util.*; // นำเข้าคลาสและอินเทอร์เฟซที่เกี่ยวข้องกับโครงสร้างข้อมูลที่มีอยู่และการดำเนินการกับข้อมูล เช่น รายการ (List), ชุดข้อมูล (Set), แผนภูมิแฮชแมป (HashMap) เป็นต้น


public class J1_JavaIf_Else {
    private static final Scanner scanner = new Scanner(System.in);

    public static void main(String[] args) {
        System.out.print("ป้อนตัวเลข : ");
        int N = scanner.nextInt();  // ใช้ Scanner เพื่อรับค่าตัวเลขจากผู้ใช้ผ่านทางคีย์บอร์ด
        //scanner.skip("(\r\n|[\n\r\u2028\u2029\u0085])?");
        if (N % 2 != 0) {  // ถ้าตัวเลข N หารด้วย 2 ไม่ลงตัว (เป็นเลขคี่) เราพิมพ์ "Weird" ออกทางหน้าจอ
            System.out.println("Weird");
        } else {
            if (N >= 2 && N <= 5) {  // ถ้าตัวเลข N เป็นเลขคู่และมีค่าระหว่าง 2 ถึง 5 เราพิมพ์ "Not Weird" ออกทางหน้าจอ
                System.out.println("Not Weird");
            } else if (N >= 6 && N <= 20) {  // ถ้าตัวเลข N เป็นเลขคู่และมีค่าระหว่าง 6 ถึง 20 เราพิมพ์ "Weird" ออกทางหน้าจอ
                System.out.println("Weird");
            } else {  // ถ้าตัวเลข N เป็นเลขคู่และมากกว่า 20 เราพิมพ์ "Not Weird" ออกทางหน้าจอ
                System.out.println("Not Weird");
            }

            scanner.close();
        }
    }
}

/*
ในโปรแกรมนี้ เราใช้ Scanner เพื่อรับค่าจำนวนเต็ม n จากผู้ใช้ แล้วตรวจสอบเงื่อนไขตามที่โจทย์กำหนดโดยใช้คำสั่ง if-else
ในการตรวจสอบ หาก n เป็นเลขคี่ เราจะพิมพ์ "Weird" ออกทางหน้าจอ ถ้า n เป็นเลขคู่ เราจะตรวจสอบเงื่อนไขเพิ่มเติมว่า n
อยู่ในช่วงใด และพิมพ์ผลลัพธ์ตามนั้นออกทางหน้าจอ ตามเงื่อนไขที่กำหนดในโจทย์
 */

